analogdevicesinc/msdk/Libraries/RF-PHY/MAX32665/include/dbb_ctrl.svd
      <register>
        <name>events_irq_test</name>
        <description>irq_test</description>
        <addressOffset>0x0086</addressOffset>
        <size>16</size>
        <fields>
          <field>
            <name>tx_done</name>
            <description>debug purpose: a pulse is generated to test the interrupt</description>
            <bitOffset>0</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>rx_received</name>
            <description>debug purpose: a pulse is generated to test the interrupt</description>
            <bitOffset>1</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>rx_energy_det</name>
            <description>debug purpose: a pulse is generated to test the interrupt</description>
            <bitOffset>2</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>rx_sfd_det</name>
            <description>debug purpose: a pulse is generated to test the interrupt</description>
            <bitOffset>3</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>rx_sfd_to</name>
            <description>debug purpose: a pulse is generated to test the interrupt</description>
            <bitOffset>4</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>rfe_spim_rdy</name>
            <description>debug purpose: a pulse is generated to test the interrupt</description>
            <bitOffset>5</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>invalid_addr</name>
            <description>debug purpose: a pulse is generated to test the interrupt</description>
            <bitOffset>6</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>gp_event</name>
            <description>debug purpose: a pulse is generated to test the interrupt</description>
            <bitOffset>7</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>tx_aes_done</name>
            <description>debug purpose: a pulse is generated to test the interrupt.</description>
            <bitOffset>8</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>rx_aes_done</name>
            <description>debug purpose: a pulse is generated to test the interrupt.</description>
            <bitOffset>9</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>decrypt_fail</name>
            <description>debug purpose: a pulse is generated to test the interrupt.</description>
            <bitOffset>10</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
          <field>
            <name>rx_sfd2_de</name>
            <description>debug purpose: a pulse is generated to test the interrupt.</description>
            <bitOffset>11</bitOffset>
            <bitWidth>1</bitWidth>
          </field>
        </fields>
      </register>
      <register>
        <name>cmu_gating_on</name>
        <description>Clock gating on</description>
        <addressOffset>0x0088</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>cmu_main_mult_p</name>
        <description>The rate multiplier multiplier value (the multiplier value can never be higher then the corresponding divider value)</description>
        <addressOffset>0x008a</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>cmu_main_div_q</name>
        <description>The rate multiplier divider value </description>
        <addressOffset>0x008c</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>cmu_phy_mult_p</name>
        <description>The rate multiplier multiplier value (the multiplier value can never be higher then the corresponding divider value)</description>
        <addressOffset>0x008e</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>cmu_phy_div_q</name>
        <description>The rate multiplier divider value </description>
        <addressOffset>0x0090</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>cmu_dl_mult_p</name>
        <description>The rate multiplier multiplier value (the multiplier value can never be higher then the corresponding divider value)</description>
        <addressOffset>0x0092</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>cmu_dl_div_q</name>
        <description>The rate multiplier divider value </description>
        <addressOffset>0x0094</addressOffset>
        <size>16</size>
      </register>
      <register>
        <name>aes_st</name>
        <description>AES status.</description>
        <addressOffset>0x0100</addressOffset>
        <size>32</size>
      </register>
      <register>
        <name>aes_aad</name>
        <description>AES address.</description>
        <addressOffset>0x0104</addressOffset>
        <size>32</size>
      </register>
      <register>
        <name>aes_ctrl</name>
        <description>AES control.</description>
        <addressOffset>0x010C</addressOffset>
        <size>32</size>
      </register>
      <register>
        <dim>16</dim>
        <dimIncrement>1</dimIncrement>
        <name>aes_key</name>
        <description>AES key.</description>
        <addressOffset>0x0110</addressOffset>
        <size>8</size>
      </register>
      <register>
        <dim>16</dim>
        <dimIncrement>1</dimIncrement>
        <name>aes_ctr_blk</name>
        <description>AES counter block.</description>
        <addressOffset>0x0120</addressOffset>
        <size>8</size>
      </register>
    </registers>
  </peripheral>
</device>
